# Мобильное приложение «Погода»

## Введение

### Наименование приложения
Наименование приложения — «Погода».

### Краткая характеристика области применения приложения
Приложение предназначено для использования на мобильных устройствах. Оно позволяет просматривать прогноз погоды в местоположении пользователя или выбранной локации с глубиной до 15 дней.

### Основания для разработки
Разработка, тестирование и внедрение приложения должны быть выполнены в течение 4 месяцев, в срок до 31.12.2024 (включительно).

## Назначение разработки

### Функциональное назначение приложения
Для пользователя система предоставляет возможность:
- Индивидуальные настройки приложения (выбор темы, глубины прогноза, включение/отключение геопозиционирования).
- Выбор локации через поиск или указание на карте.
- Сохранение избранных локаций.
- Просмотр прогноза на выбранную дату.
- Написание отзыва о работе приложения.

### Эксплуатационное назначение приложения
Приложение должно эксплуатироваться на смартфонах с операционными системами Android и iOS. Конечными пользователями приложения будут владельцы данных мобильных устройств.

## Требования к программе

### Требования к составу выполняемых функций
Программа должна обеспечить выполнение следующих функций:
1. Выбор темы оформления.
2. Персональные настройки, включая настройки уведомлений.
3. Внесение и редактирование данных пользователя.
4. Поиск локации по части слова.
5. Просмотр локаций на карте (интеграция со службой «Яндекс Карты»).
6. Просмотр прогноза (за несколько часов, за неделю, почасовой, за 15 дней).
7. Доступ к геопозиционированию устройства.
8. Сохранение/удаление избранных мест (локаций).
9. Просмотр прогноза на выбранную дату.
10. Написание отзыва о работе приложения.

### Требования к организации входных и выходных данных - описание формата данных
**Входные данные:** Логин и пароль пользователя (может быть номер телефона или электронная почта).  
**Выходные данные:** Перезаписанные данные о событиях, сохраненные на устройстве в случае успешной авторизации. Либо сообщение о неверно введенных данных.

### Требования к временным характеристикам
Скорость отклика приложения должна составлять не более 0,05 секунд. После изменения данных в базе данных, новая информация на клиентах должна отображаться не позднее, чем через 3 секунды (при условии стабильного интернет-соединения со скоростью не менее 100 Мбит/сек). Аналогично, после изменения данных пользователем, в базе данных новая информация должна отображаться не позднее, чем через 3 секунды (при условии стабильного интернет-соединения со скоростью не менее 100 Мбит/сек).

### Требования к надежности
Приложение должно соответствовать всем правилам современного законодательства, включая:
1. Федеральный закон "О персональных данных" от 27.07.2006 №152-ФЗ.
2. Федеральный закон «О внесении изменений в Уголовный кодекс Российской Федерации и Уголовно-процессуальный кодекс Российской Федерации в части установления дополнительных мер противодействия терроризму и обеспечения общественной безопасности» от 06.07.2016 №375-ФЗ.
Перед началом использования мобильного приложения пациенту должно быть предложено подписать соглашение или информированное согласие на обработку и хранение его персональных данных. Приложение должно быть защищено от кибератак, соблюдаться требования по шифрованию, передаче и хранению персональных данных пользователей. Данные о пациентах должны храниться на серверах, расположенных на территории России. Базу данных стоит резервировать (резервирование замещением). При наличии активных записей приложение должно функционировать 24/7, в том числе в фоновом режиме, активные записи должны быть доступны для просмотра, в том числе в офлайн-режиме. Вероятность работы системы без сбоев должна составлять не менее 99.99% при условии исправной работы устройства (мобильный телефон включен, уровень заряда аккумулятора достаточен).

### Условия эксплуатации
Должна существовать устойчивая связь по сети между пользователями и базой данных. Обязательной составляющей регламентных работ должно быть периодическое резервное копирование информационных ресурсов, в том числе базы данных, исполняемых и исходных кодов программного обеспечения.

### Требования к составу и параметрам технических средств
1. Платформа работы приложения: iOS/Android.
2. Совместимость с ОС: iOS 8.0 и старше, Android 4.4 и старше.
3. Поддержка устройств: iPhone 5S и выше, Android 4.4 и выше.
4. Сервер: совместимый вебхостинг на базе Apache.

### Требования к информационной и программной совместимости
Целостность сервиса должна обеспечиваться совместимостью протоколов взаимодействия и совместимостью интерфейсов мобильных устройств. Информационная совместимость со смежными системами должна достигаться за счет использования стандартного протокола обмена структурированными сообщениями REST/HTTP.

### Требования к программной документации
Предварительный состав программной документации:
1. Техническое задание.
2. Технический проект.
3. Программа и методика испытаний (перечень тест-кейсов).
4. Протокол испытаний.
5. Акт приемки-сдачи в эксплуатацию.
6. Руководство программиста.
7. Руководство пользователя.

## Технико-экономические показатели
Ориентировочная экономическая эффективность не рассчитывается.

## Стадии и этапы разработки
Разработка должна состоять из следующих этапов:
1. Оценка и планирование приложения.
2. Анализ рынка, конкурентов, определение целевой аудитории и бизнес-цели компании.
3. Определение бюджета, сроков и объемов работ по проекту.
4. Формирование и согласование плана-графика работ.
5. Аналитика продукта.
6. Сбор требований.
7. Разработка технического задания.
8. Согласование и утверждение технического задания.
9. Разработка дизайна приложения (UX/UI), проектирование прототипа.
10. Разработка приложения (написание кода, проработка архитектуры и логики, клиентского сервиса).
11. Тестирование (разработка, согласование и утверждение ПМИ, проведение приемо-сдаточных испытаний, багфиксинг).
12. Внедрение MVP.
13. Подготовка скриншотов страниц приложения, плана продвижения и описания программы.
14. Загрузка приложения в App Store и Google Play.
15. Доработка функционала MVP и выпуск нового релиза.
16. Техподдержка и развитие приложения.

## Порядок контроля и приемки
Приемосдаточные испытания приложения должны проводиться согласно разработанной «Программе и методикам испытаний». Ход проведения приемо-сдаточных испытаний заказчик и исполнитель документируют в протоколе испытаний. На основании протокола испытаний исполнитель и заказчик подписывают акт приемки-сдачи программы в эксплуатацию.
